[
  {
    "title": "I Went On Strike Because It Was A Time Limit",
    "latestChapter": "manga_store\\contents\\i-went-on-strike-because-it-was-a-time-limit\\Chapter 109",
    "views": "942",
    "description": "You are reading I Went On Strike Because It Was A Time Limit manga, one of the most popular manga covering in Isekai, Manhwa, Romance, Shoujo genres, written by  at MangaBuddy, a top manga site to offering for   free. I Went On Strike Because It Was A Time Limit has 109 translated chapters and translations of other chapters are in progress. Lets enjoy. If you want to get the updates about latest chapters, lets create an account and add I Went On Strike Because It Was A Time Limit to your bookmark.\n\n                                            I Went On Strike Because It Was A Time Limit manhwa, went on strike because it was the deadline,  She has only one month to live so she went on a strike and doesn't want her father to expect her to live as his daughter with such annoying and complicated things. Then, she bought a house on her own, made friends, and confessed to him but it wasn't actually a deadline?!* * *\"Young-ae can only live for one month.\"Oh, right?Then the Imperial White Magnolia' and The Flower of the Social World' will all go on strike!Don't expect my father and older brothers to be daughters of me anymore. Did you treat me like someone else in the first place?Now I have only a month left to live with such annoying and complicated things! She went on strike because she had a deadline, but she's not on a deadline.",
    "img_path": "manga_store\\contents\\i-went-on-strike-because-it-was-a-time-limit\\img.webp"
  },
  {
    "title": "Addicted to Deathly Desire",
    "latestChapter": "manga_store\\contents\\addicted-to-deathly-desire\\Chapter 14",
    "views": "208",
    "description": "You are reading Addicted to Deathly Desire manga, one of the most popular manga covering in Webtoons, Yaoi, Action, Drama, Romance, Supernatural genres, written by 焦糖冬瓜 at MangaBuddy, a top manga site to offering for   free. Addicted to Deathly Desire has 15 translated chapters and translations of other chapters are in progress. Lets enjoy. If you want to get the updates about latest chapters, lets create an account and add Addicted to Deathly Desire to your bookmark.\n\n                                            #Yandere #SmartSemeIn a world where humanity is rebuilding after the zombie apocalypse, Mason, a science academy cadet, dreams of a quiet, easy life amidst the safety of the underground city. But everything changes when he's saved by the legendary Henrik Burton of the Special Task Force. Mason can't help but be drawn to Henrik, captivated by his enigmatic presence, while Henrik, too, begins to contemplate how to 'devour' the naive cadet...",
    "img_path": "manga_store\\contents\\addicted-to-deathly-desire\\img.webp"
  },
  {
    "title": "I Will Become the Hero’s Mother",
    "latestChapter": "manga_store\\contents\\i-will-become-the-heros-mother\\Chapter 115",
    "views": "672",
    "description": "You are reading I Will Become the Hero’s Mother manga, one of the most popular manga covering in Webtoons, Shoujo, Fantasy, Historical genres, written by Elianyang at MangaBuddy, a top manga site to offering for   free. I Will Become the Hero’s Mother has 118 translated chapters and translations of other chapters are in progress. Lets enjoy. If you want to get the updates about latest chapters, lets create an account and add I Will Become the Hero’s Mother to your bookmark.\n\n                                            not found...",
    "img_path": "manga_store\\contents\\i-will-become-the-heros-mother\\img.webp"
  },
  {
    "title": "Once a Predator, Now a Sacrifice [Official]",
    "latestChapter": "manga_store\\contents\\once-a-predator-now-a-sacrifice-official\\Chapter 34",
    "views": "39,911",
    "description": "N/A",
    "img_path": "manga_store\\contents\\once-a-predator-now-a-sacrifice-official\\img.webp"
  },
  {
    "title": "Vtuber Confucius",
    "latestChapter": "manga_store\\contents\\vtuber-confucius\\Chapter 13",
    "views": "104",
    "description": "N/A",
    "img_path": "manga_store\\contents\\vtuber-confucius\\img.webp"
  },
  {
    "title": "Campus Truth game",
    "latestChapter": "manga_store\\contents\\campus-truth-game\\Chapter 4",
    "views": "3,092",
    "description": "You are reading Campus Truth game manga, one of the most popular manga covering in Webtoons, Yaoi, Adult, Mature, Smut, Comedy genres, written by Soui at MangaBuddy, a top manga site to offering for   free. Campus Truth game has 4 translated chapters and translations of other chapters are in progress. Lets enjoy. If you want to get the updates about latest chapters, lets create an account and add Campus Truth game to your bookmark.\n\n                                            Han Joo, who easily gets along with anyone but struggles to form deep relationships, encounters Kwon Young, who is crying and drunk from the pain of a breakup. Contrary to his initial impression of being sensitive, Kwon Young is actually a well-known troublemaker at school. To think that someone like him could care for someone so deeply... Han Joo, despite not wanting to get entangled with Kwon Young, finds himself strangely preoccupied with him.",
    "img_path": "manga_store\\contents\\campus-truth-game\\img.webp"
  },
  {
    "title": "Thanks To My Childhood Friend, I Became A Top Guide",
    "latestChapter": "manga_store\\contents\\thanks-to-my-childhood-friend-i-became-a-top-guide\\Chapter 32",
    "views": "734",
    "description": "You are reading Thanks to My Childhood Friend, I Became a Top Guide manga, one of the most popular manga covering in Drama, Fantasy, Manhua, Romance genres, written by 脆皮你鱼 at MangaBuddy, a top manga site to offering for   free. Thanks to My Childhood Friend, I Became a Top Guide has 33 translated chapters and translations of other chapters are in progress. Lets enjoy. If you want to get the updates about latest chapters, lets create an account and add Thanks to My Childhood Friend, I Became a Top Guide to your bookmark.\n\n                                            Thanks to My Childhood Friend, I Became a Top Guide, , Kao Fa Xiao Wo Bian Shen Dingji Xiangdao at manhwawebsiteBaek-ya spends her daily life comforting Ji-chan, her long-time childhood friend and self-proclaimed junk car collector, but one day, she becomes concerned when Lee Hyeon, everyone's ideal type, suddenly appears in front of them.As expected, Ji-chan's intuition was wrong, as Lee Hyun was spreading promiscuous rumors around the school and was the center of all topics of conversation.Baek-ya is adamantly opposed to Ji-chan, saying that Lee Hyun can't be the only one, but Ji-chan actually asks Baek-ya to become friends with Lee Hyeon and build a bridge.Baek-ya, who could not completely refuse his friend's request, keeps a close eye on Lee Hyun to find a reason for Ji-chan to dislike Lee Hyeon, and in the meantime, he hears shocking words from Lee Hyun .\"Aren't you showing too much that you like me?\"Maybe you like !",
    "img_path": "manga_store\\contents\\thanks-to-my-childhood-friend-i-became-a-top-guide\\img.webp"
  },
  {
    "title": "I Didn’t Know It Was a Prize at the Time",
    "latestChapter": "manga_store\\contents\\i-didnt-know-it-was-a-prize-at-the-time\\Chapter 49",
    "views": "51,151",
    "description": "You are reading I Didn’t Know It Was a Prize at the Time manga, one of the most popular manga covering in Action, Drama, Fantasy, Shounen genres, written by Chaurenz, Mageom at MangaBuddy, a top manga site to offering for   free. I Didn’t Know It Was a Prize at the Time has 49 translated chapters and translations of other chapters are in progress. Lets enjoy. If you want to get the updates about latest chapters, lets create an account and add I Didn’t Know It Was a Prize at the Time to your bookmark.\n\n                                            I Don't Know It Was a Prize at the Time at What are the pieces of cubes that he received as a reward for months of hard work in the hidden quest game given to Seo Yeon-woo, who earns his living by playing games? These aren't scammers! Give me my blo*** time! But when the cube touched my hand, a strange thing happened. \"You have become the owner of the ancient magic weapon Gigantes Dark'.\" I Am I pinning my life now? is it great? The adventure story of Seo Yeon-woo, a livelihood gamer, and Gigantes Dark, an ancient weapon!I Don't Know It Was a Prize at the Time, Back Then, I Didn't Realize It Was a Big Win, I Didn't Know It Was a Prize at the Time, I Don't Know Its Worth Then,    mangabuddy is a website dedicated to fans of anime, , , , video games, and cosplay. Where you may find all of your anime-related memes, recommendations, reviews, manga recommendations, character fanfiction, favorite quotations, and simply those ordinary anime things that you enjoy, particularly memes.You can ,  online for free at mangabuddy. Chapters are updated hourly with high-quality graphics and a full English translation. Find free translations of your favorite ,  and . The latest updated content on mangabuddy is now available.",
    "img_path": "manga_store\\contents\\i-didnt-know-it-was-a-prize-at-the-time\\img.webp"
  },
  {
    "title": "Ascension: From Water Spirit to Deity",
    "latestChapter": "manga_store\\contents\\ascension-from-water-spirit-to-deity\\Chapter 36",
    "views": "117,007",
    "description": "You are reading Ascension: From Water Spirit to Deity manga, one of the most popular manga covering in Manhua genres, written by  at MangaBuddy, a top manga site to offering for   free. Ascension: From Water Spirit to Deity has 37 translated chapters and translations of other chapters are in progress. Lets enjoy. If you want to get the updates about latest chapters, lets create an account and add Ascension: From Water Spirit to Deity to your bookmark.\n\n                                            The protagonist, Liang Qu, transmigrates to a world called Da Shun. When he is framed and falls into a crisis, he miraculously awakens a system called \"Ze Ding,\" and everything changes! The protagonist is about to fuse with the bloodline of ancient divine beasts, gaining immense power, enhancing his talents, and even acquiring the skills of godlike warriors. Let's go! Fuse with the Ze Ling bloodline!System: \"Awakening the Ze Ling bloodlineWater Monkey.\"Protagonist: \"???\"",
    "img_path": "manga_store\\contents\\ascension-from-water-spirit-to-deity\\img.webp"
  },
  {
    "title": "Exclusive Maid Of The Evil Empress",
    "latestChapter": "manga_store\\contents\\exclusive-maid-of-the-evil-empress\\Chapter 103",
    "views": "1,452,472",
    "description": "You are reading Exclusive maid of the evil empress manga, one of the most popular manga covering in Shoujo, Comedy, Fantasy genres, written by 해연 at MangaBuddy, a top manga site to offering for   free. Exclusive maid of the evil empress has 104 translated chapters and translations of other chapters are in progress. Lets enjoy. If you want to get the updates about latest chapters, lets create an account and add Exclusive maid of the evil empress to your bookmark.\n\n                                            Became the exclusive maid of the notorious empress. But what about the bad girl? The Empress is nothing but a petulant cat, and strangely she likes me. \"Your Majesty, I don't need to make my social debut.\" \"If you're noble, you should make your official social debut at the ball. There's nothing else to care about. Because I'm here.\" I don't want to make a social debut or anything. The empress quickly examined my appearance and even caught my scattered hair. I think the role of the maid-in-law and the empress has changed, but it's probably because of their feelings, right? \"If you show up holding the crown prince's hand, it'll be the best social debut ever. It's a moment that every aristocratic spirit in the system dreams of.\" I don't dream! I glanced, speechless. Towards the crown prince, the greatest beauty of the empire called the work of art in human masks. Dressed up by the empress, a maid dancing her debut dance with the crown prince. What the he** is going on here?+",
    "img_path": "manga_store\\contents\\exclusive-maid-of-the-evil-empress\\img.webp"
  },
  {
    "title": "Reliance",
    "latestChapter": "manga_store\\contents\\reliance\\Chapter 17",
    "views": "10,420",
    "description": "N/A",
    "img_path": "manga_store\\contents\\reliance\\img.webp"
  },
  {
    "title": "I Can't Escape From My Contract Husband's Doting Love",
    "latestChapter": "manga_store\\contents\\i-can-t-escape-from-my-contract-husband-s-doting-love\\Chapter 9",
    "views": "5,637",
    "description": "Jiang Yan was forced into an arranged marriage by her stepmother, which quickly became a trending topic online. To get out of the mess, she agreed to a contract marriage with Gu Linxiu, someone she had just met. What Jiang Yan thought about Gu Linxiu: wealthy, wheelchair-bound, and still mourning a lost love from his past. Reality: he is rich — extremely so. His disability? Just a misunderstanding. And his \"lost love\"? She’s not dead at all. In fact, it’s her. When Jiang Yan saw the wall full of photos of her and Gu Linxiu from their younger years — along with secretly taken pictures of her daily life — she was completely stunned. Wait… was she in the dark about their relationship this whole time and no one told her?",
    "img_path": "manga_store\\contents\\i-can-t-escape-from-my-contract-husband-s-doting-love\\img.webp"
  },
  {
    "title": "Once a Predator, Now a Sacrifice",
    "latestChapter": "manga_store\\contents\\once-a-predator-now-a-sacrifice\\Chapter 34",
    "views": "25,501",
    "description": "You are reading Once a Predator, Now a Sacrifice manga, one of the most popular manga covering in Webtoons, Josei, Drama, Fantasy genres, written by Ika Hotaru, Yuio Shizusa at MangaBuddy, a top manga site to offering for   free. Once a Predator, Now a Sacrifice has 34 translated chapters and translations of other chapters are in progress. Lets enjoy. If you want to get the updates about latest chapters, lets create an account and add Once a Predator, Now a Sacrifice to your bookmark.\n\n                                            When the villainess comes back to life, she discovers that the prince who once hated her is now madly in love with her?! In this world, \"Predators\" are the rulers who wield powerful magic, while those born with the \"Mark of Sacrifice\" are despised as mere wells of magic for Predators to absorb and tools for bearing offspring. Prince Greg, second in line to the throne, recently rejected a marriage offer from Lady Letishia, a vile Predator. Determined to understand his reasons, she confronts him at the palaceonly for both of them to become victims of an assassination attempt, losing their lives in the process. The next moment, Letishia finds herself transported back in time to the day she went to see Greg. Yet, this miraculous second chance comes at a price: she now bears the Mark of Sacrifice. Imprisoned by her family and facing a future of exploitation, Letishia strikes a deal with Greg, offering him her magic in exchange for his protection. Though they wed under the terms of a loveless contract, Greg seems to have fallen deeply in love with Letishia. But is this genuine love, or is it simply the mark's influence?",
    "img_path": "manga_store\\contents\\once-a-predator-now-a-sacrifice\\img.webp"
  },
  {
    "title": "My Farm by the Palace",
    "latestChapter": "manga_store\\contents\\my-farm-by-the-palace\\Chapter 90",
    "views": "52,392",
    "description": "You are reading My Farm by the Palace manga, one of the most popular manga covering in Comedy, Drama, Fantasy, Historical, Magic, Manhwa, Romance, Webtoons genres, written by Jeong Yeon at MangaBuddy, a top manga site to offering for   free. My Farm by the Palace has 90 translated chapters and translations of other chapters are in progress. Lets enjoy. If you want to get the updates about latest chapters, lets create an account and add My Farm by the Palace to your bookmark.\n\n                                            My Farm by the PalaceWhen Hazel Mayfield is sent to live with the Martins as a child, she falls in love with rural life and vows to have a farm of her own one day. Eleven years later, she receives an unexpected windfall as her grandfather hands her the deed to a plot of land in the middle of the capital. Ecstatic, Hazel sets out to realize her longtime dream of becoming a farmer. There's only one problem: Her new farm is right next to the imperial palace! And it seems the emperor himself has his eye on her land",
    "img_path": "manga_store\\contents\\my-farm-by-the-palace\\img.webp"
  },
  {
    "title": "Mini 4Wd Fighter V",
    "latestChapter": "manga_store\\contents\\mini-4wd-fighter-v\\Chapter 30.5",
    "views": "16,398",
    "description": "You are reading Mini 4Wd Fighter V manga, one of the most popular manga covering in Comedy, Shounen, Sports genres, written by Aoki Takao at MangaBuddy, a top manga site to offering for   free. Mini 4Wd Fighter V has 33 translated chapters and translations of other chapters are in progress. Lets enjoy. If you want to get the updates about latest chapters, lets create an account and add Mini 4Wd Fighter V to your bookmark.\n\n                                            Mini 4WD Fighter, the iconic superhero of the Mini 4WD hobby! He loves the hobby just as much as the kids and shows his enthusiasm though his commentary through tournaments while cheering the racers in fair play.",
    "img_path": "manga_store\\contents\\mini-4wd-fighter-v\\img.webp"
  },
  {
    "title": "Temptation Of Wife",
    "latestChapter": "manga_store\\contents\\temptation-of-wife\\Chapter 68",
    "views": "133,849",
    "description": "You are reading Temptation of Wife manga, one of the most popular manga covering in Drama, Fantasy, Manhwa, Romance genres, written by  at MangaBuddy, a top manga site to offering for   free. Temptation of Wife has 70 translated chapters and translations of other chapters are in progress. Lets enjoy. If you want to get the updates about latest chapters, lets create an account and add Temptation of Wife to your bookmark.\n\n                                            Read manhwa Temptation of Wife /  Tender-hearted Jerenia is married to the most uncaring and disrespectful husband, Vincent Mercier. Her in-laws undermine and abuse her daily, but Jerenia believes that if she bears a child, she could be respected as part of the dukedom. After trying for seven years, she finally conceives a child, only to find out that Vincent's been cheating on her with her childhood friend, Erica. Vincent conspires to kill his wife, but surviving the murder attempt has turned Jerenia into a woman of vengeance.",
    "img_path": "manga_store\\contents\\temptation-of-wife\\img.webp"
  },
  {
    "title": "Introvert Tsubame Wants To Change",
    "latestChapter": "manga_store\\contents\\introvert-tsubame-wants-to-change\\Chapter 27",
    "views": "408,054",
    "description": "You are reading Introvert Tsubame Wants to Change manga, one of the most popular manga covering in Romance, School life, Shoujo, Slice of life genres, written by Grande at MangaBuddy, a top manga site to offering for   free. Introvert Tsubame Wants to Change has 27 translated chapters and translations of other chapters are in progress. Lets enjoy. If you want to get the updates about latest chapters, lets create an account and add Introvert Tsubame Wants to Change to your bookmark.\n\n                                            The story is about a university student, Tsubame Takashina, who has no presence, meets a boy, Taisei Kyogoku, and tries to overcome her negative attitude little by little.(https://www.pixiv.net/en/artworks/109457638) (Not included in the Pixiv Series Index)(https://www.melonbooks.co.jp/detail/detail.php?product_id=2005392)",
    "img_path": "manga_store\\contents\\introvert-tsubame-wants-to-change\\img.webp"
  },
  {
    "title": "You Are My Living Faith",
    "latestChapter": "manga_store\\contents\\you-are-my-living-faith\\Chapter 24",
    "views": "16,110",
    "description": "You are reading You Are My Living Faith manga, one of the most popular manga covering in Webtoons, Shoujo, Drama, Fantasy, Romance genres, written by Iqiyi Comics, 深海有光 at MangaBuddy, a top manga site to offering for   free. You Are My Living Faith has 23 translated chapters and translations of other chapters are in progress. Lets enjoy. If you want to get the updates about latest chapters, lets create an account and add You Are My Living Faith to your bookmark.\n\n                                            A thousand-year-old monster and a human girl - their love travels across a millennium...She, who can see monsters, meets him, who has lived for a thousand years and longs for a quick death. He's the only one who can protect her, expelling monsters for her.A spiritual agreement reveals their entanglements from the previous life.\"Protecting you is the only reason that I live...'",
    "img_path": "manga_store\\contents\\you-are-my-living-faith\\img.webp"
  },
  {
    "title": "When The Count’s Illegitimate Daughter Gets Married",
    "latestChapter": "manga_store\\contents\\when-the-counts-illegitimate-daughter-gets-married\\Chapter 107",
    "views": "34,182",
    "description": "You are reading When The Count’s Illegitimate Daughter Gets Married manga, one of the most popular manga covering in Fantasy, Historical, Manhwa, Romance genres, written by 랏슈 at MangaBuddy, a top manga site to offering for   free. When The Count’s Illegitimate Daughter Gets Married has 109 translated chapters and translations of other chapters are in progress. Lets enjoy. If you want to get the updates about latest chapters, lets create an account and add When The Count’s Illegitimate Daughter Gets Married to your bookmark.\n\n                                            Read manhwa When The Count's Illegitimate Daughter Gets Married /   \"Dirty wench! You stole my necklace!\" \"Unless I knew where your necklace was, I wouldn't have been able to take it.\" As an illegitimate child, Laritte's biggest sin was being born. In the year she became an adult, she was sent to marry the ghost duke who was rumored to be dead. Her miserable life seemed to get worse and worse, however Her life changed when the duke came back alive. \"Madam, how do you like it?\" Kind servants, \"You have enough luxury to buy some residences in the capital.\" \"no one will be able to look down on you anymore.\" And the empire's devoted and murderous duke. It was already too late for those who tormented Laritte to regret it.",
    "img_path": "manga_store\\contents\\when-the-counts-illegitimate-daughter-gets-married\\img.webp"
  },
  {
    "title": "Slow Life In Another World (I Wish!)",
    "latestChapter": "manga_store\\contents\\slow-life-in-another-world-i-wish\\Chapter 52",
    "views": "37,848",
    "description": "After being a drained office worker, Itsuki Shimomiya may have found the ultimate prize by reincarnating into a mystical realm. He believes he hit the jackpot as he realizes his magical ability generates a large sum of money regularly. He can finally unwind without confronting fantasy book monsters. Yet, the cost of dwelling in this unearthly dimension is exorbitant. Will Itsuki's wit and supernatural acumen facilitate his pursuit for a serene existence?",
    "img_path": "manga_store\\contents\\slow-life-in-another-world-i-wish\\img.webp"
  },
  {
    "title": "The Male Lead And I Are Trapped In A Horror Game",
    "latestChapter": "manga_store\\contents\\the-male-lead-and-i-are-trapped-in-a-horror-game\\Chapter 65",
    "views": "61,597",
    "description": "You are reading The Male Lead and I Are Trapped In A Horror Game manga, one of the most popular manga covering in Drama, Fantasy, Manhwa, Romance, Webtoons genres, written by  at MangaBuddy, a top manga site to offering for   free. The Male Lead and I Are Trapped In A Horror Game has 65 translated chapters and translations of other chapters are in progress. Lets enjoy. If you want to get the updates about latest chapters, lets create an account and add The Male Lead and I Are Trapped In A Horror Game to your bookmark.\n\n                                            Read manhwa The Male Lead and I Are Trapped In A Horror Game /    I gave penalties to and guided the male lead who is trapped in the mansion and is trying to escape. I was just going to roughly fulfill my duties until the male lead finished playing.\"As soon as I get out, I'll lock you up the same way.\"He talked too much. As soon as this happened, I decided to help him escape.\"Let's eat, Dietrich.\"\"It's a potion. You'll heal right away if you apply it.\"\"The hint to escape this is over there.\"I fed him well to prepare him for the next scene, gave him a potion to help him play efficiently when he got hurt, and even gave him hints about the problem.Well, now we can leave the mansion, right?However\" Well, I don't know about that.\"What does he mean by that? Dietrich had no intention of leaving the mansion.\"Well, if you don't go out, I will.\"I was so annoyed at the thought of having to keep looking at him that I shouted in anger.\"Didn't you desparately wanted to get out of here?\"His eyes sank bitterly.\"I'm telling you, I have no intention of getting out of here.\"\"What?\"\"And you can't leave either.\"How on earth did this happen?",
    "img_path": "manga_store\\contents\\the-male-lead-and-i-are-trapped-in-a-horror-game\\img.webp"
  },
  {
    "title": "Jumidoro",
    "latestChapter": "manga_store\\contents\\jumidoro\\Chapter 9",
    "views": "6,840",
    "description": "You are reading Jumidoro manga, one of the most popular manga covering in Action, Drama, Fantasy, Shounen, Slice of life genres, written by Taki Hongichi at MangaBuddy, a top manga site to offering for   free. Jumidoro has 9 translated chapters and translations of other chapters are in progress. Lets enjoy. If you want to get the updates about latest chapters, lets create an account and add Jumidoro to your bookmark.\n\n                                            In the Colosseum, there was a gladiator girl known as the **Unbeaten Sword**  Ramune. Bought as a slave, Ramune unexpectedly found freedom after a carriage accident. The girl, now free, sets off to see the world, learn, and experience the kindness of others as she lives on. However, Ramune doesn't know what \"normal\" is. She has never been taught not to slay people, or that killing is wrong...",
    "img_path": "manga_store\\contents\\jumidoro\\img.webp"
  },
  {
    "title": "Confined Together with the Horror Game’s Male Lead",
    "latestChapter": "manga_store\\contents\\confined-together-with-the-horror-games-male-lead\\Chapter 65",
    "views": "64,749",
    "description": "You are reading Confined Together with the Horror Game’s Male Lead manga, one of the most popular manga covering in Webtoons, Josei, Shoujo, Action, Adventure, Drama, Fantasy, Horror, Romance genres, written by Flangby, 플랑비 at MangaBuddy, a top manga site to offering for   free. Confined Together with the Horror Game’s Male Lead has 66 translated chapters and translations of other chapters are in progress. Lets enjoy. If you want to get the updates about latest chapters, lets create an account and add Confined Together with the Horror Game’s Male Lead to your bookmark.\n\n                                            I became a maid in a horror game.And, here in this mansion, I was confined together with the male lead, who's trying to escape. My role here was to guide him around the mansion and to give him penalties once in a while.I just need to fulfill my NPC duties until the male lead's playthrough is over.\"Once I get out, I'll have you locked up the same way.\"This male lead was kicking up quite the racket though.So I decided to help him escape as soon as possible.\"Let's eat, Dietrich.\"\"That's a potion. It'll get you healed up right away.\"\"The escape hint is right over there\"I stuffed him well enough so he had enough energy for the next part of the game.I gave him a potion to use in case he got hurt.I also gave him some hints to solve the problem.Then, we can get out now, right?However.\"Not sure. I don't know the answer.\"Look here, smart guy. What exactly do you mean by that?The male lead doesn't want to leave the mansion.\"If you're not leaving, then I will!\"I shouted in a fit of anger. At the thought of having to keep looking at this hateful guy's face, I was justifiably annoyed.\"Is this truly the kind of place that you can get out of?\"As he said this, the look in his eyes darkened sharply.\"Just so we're clear, I have absolutely no intention of getting out of here.\"\"What?\"\"And you're not leaving either.\"How the he** did it come to this?+",
    "img_path": "manga_store\\contents\\confined-together-with-the-horror-games-male-lead\\img.webp"
  },
  {
    "title": "One-Of-A-Kind Irregular",
    "latestChapter": "manga_store\\contents\\one-of-a-kind-irregular\\Chapter 110",
    "views": "4,589,533",
    "description": "You are reading One-of-a-Kind Irregular manga, one of the most popular manga covering in Action, Adventure genres, written by  at MangaBuddy, a top manga site to offering for   free. One-of-a-Kind Irregular has 110 translated chapters and translations of other chapters are in progress. Lets enjoy. If you want to get the updates about latest chapters, lets create an account and add One-of-a-Kind Irregular to your bookmark.\n\n                                            One in seven billion irregular / One-of-a-Kind Irregular,70 1  / One-of-a-Kind Irregular ( Irregular of 1 in 7 billion)One-of-a-Kind Irregular manhwa, Irregular of 1 in 7 billion , 70 1 , One in seven billion irregularJoo Seung-ho is unable to do virtual reality due to 'congenital hyperimmersion syndrome', a phenomenon of excessive sensory amplification.One day, a string of unknown colors comes down to him.It is the tester of the 4th generation VRS' device!When he was able to do virtual reality by becoming a tester, he thought for the first time.That what he caught was a rope made of gold.When he experienced Lost Sky Online', commonly referred to as the 4th generation, he realized it.The congenital hyperimmersion syndrome' was a poison in the past, but it was actually a blessing.It's time to change into a new him' that was different from his usual self.[Welcome to the world of the Lost Sky.]",
    "img_path": "manga_store\\contents\\one-of-a-kind-irregular\\img.webp"
  }
]